In [4]:
import numpy as np
import pandas as pd

##날짜형
#to_datetime
#or 불러올 때 서식 지정
#errors = 어쩌구 없으면 null처리하라

df = pd.read_csv("train.csv")
df2 = pd.read_csv("titanic_with_duplicates.csv")    #중복데이터가 있는 파일

In [5]:
mask = df["Age"] > 70
mask

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [6]:
df[mask]['Age']
df.loc[mask]['Age'] #둘다 같지만 이걸더추천

96     71.0
116    70.5
493    71.0
630    80.0
851    74.0
Name: Age, dtype: float64

In [7]:
## 두개 넣을 때는 리스트로
# 하나 넣으면 시리즈로 봄. 두개부터는 df화가되니까
df.loc[mask, ['Age', 'Name']]

      Age                                  Name
96   71.0             Goldschmidt, Mr. George B
116  70.5                  Connors, Mr. Patrick
493  71.0               Artagaveytia, Mr. Ramon
630  80.0  Barkworth, Mr. Algernon Henry Wilson
851  74.0                   Svensson, Mr. Johan

In [8]:
# elderly_df = df[mask]
# 또는
elderly_df = df.loc[mask]
elderly_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [9]:
data = {'이름': ['철수', '영희', '민수', '수지', '호영'],
        '나이': [25, 32, 40, 28, 18],
        '도시': ['서울', '대전', '인천', '대구', '부산']}
df3 = pd.DataFrame(data) # 어 이거 어제 pandas 에서 배운 거 dataFrame으로 만든다~ 딕셔너리를?
print(df3)

   이름  나이  도시
0  철수  25  서울
1  영희  32  대전
2  민수  40  인천
3  수지  28  대구
4  호영  18  부산

In [10]:
type(df3)

pandas.core.frame.DataFrame

In [11]:
mask = df3['나이'] >= 30       #아~~~ 여기서 []나 ()가 아니니까 결과가 불리언 시리즈로 나와서 그게 mask에 들어가서 아하 ㅇㅋㅇㅋ
mask2 = df3['이름'] == '영희'

In [12]:
mask = (df3['도시'] == '서울') | (df3['나이'] >= 20)

In [13]:
conditions = (df3['도시'] != '서울') | (df3['이름'])

In [14]:
# conditions = (df3['도시'] == ('서울'|'부산'))   #헤헤 안되네

# conditions = (df3['도시']).isin('서울'|'부산')  ## 너도 안되네

conditions = (df3['도시']).isin(['서울', '부산'])
#이거야 ㅋ

In [15]:
####
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [17]:
mask_age = df['Age'] >= 70
mask_age

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [18]:
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [19]:
df['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [20]:
mask_vip = (df['Pclass'] == 1) & (df['Sex'] == 'female')
mask_vip

0      False
1       True
2      False
3       True
4      False
       ...
886    False
887     True
888    False
889    False
890    False
Length: 891, dtype: bool

In [21]:
mask_age2 = (df['Age'] < 15 ) | (df['Age'] > 80)
df[mask_age2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.00,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
827,828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,347082,31.2750,NaN,S
852,853,0,3,"Boulos, Miss. Nourelain",female,9.00,1,1,2678,15.2458,NaN,C
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S

In [22]:
df.loc[mask_age2, 'Age'].describe()

count    78.000000
mean      5.816282
std       4.320822
min       0.420000
25%       2.000000
50%       4.000000
75%       9.000000
max      14.500000
Name: Age, dtype: float64

In [23]:
result = df.loc[mask_age2, 'Age'].describe()
result.describe

<bound method NDFrame.describe of count    78.000000
mean      5.816282
std       4.320822
min       0.420000
25%       2.000000
50%       4.000000
75%       9.000000
max      14.500000
Name: Age, dtype: float64>

In [24]:
df['Embarked'].value_counts

<bound method IndexOpsMixin.value_counts of 0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object>

In [25]:
df['Embarked'].isin(['C', 'Q'])

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889     True
890     True
Name: Embarked, Length: 891, dtype: bool

In [26]:
temp_na = df[(df["Age"] < 16) | (df["Age"].isna())]

In [27]:
temp_na = df[(df["Age"] < 16) | (df["Age"].notna())]

In [28]:
### 필터 후 수정은 반드시 .loc로 하자!
#왜지용
#인덱싱을 두번 할거임
df[df['Age'] > 70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [29]:
df[df['Age'] > 70]["Fare"]      #Fare만 봐야징~~

96     34.6542
116     7.7500
493    49.5042
630    30.0000
851     7.7750
Name: Fare, dtype: float64

In [30]:
df[df['Age'] > 70]["Fare"] = 0  #위에 나온 결과들 다 0으로 만든다는 말

#SettingWithCopyWarning 
#원본에서 바뀌는 거야 아니면 복사본? 새로운 거에서 만들 거야? 라는 뜻

#A value is trying to be set on a copy of a slice from a DataFrame.
# Try using .loc[row_indexer,col_indexer] = value instead/

#위험한데 .loc 하는 거 어떄? 라는 뜻

C:\Users\user\AppData\Local\Temp\ipykernel_5684\613496453.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df['Age'] > 70]["Fare"] = 0  #위에 나온 결과들 다 0으로 만든다는 말

In [31]:
sub = df[df["Age"] > 70]
sub["Fare"] = 0  # sub만 바뀌고, df는 안 바뀔 수 있음

C:\Users\user\AppData\Local\Temp\ipykernel_5684\3018455653.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sub["Fare"] = 0  # sub만 바뀌고, df는 안 바뀔 수 있음

In [32]:
sub

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,0,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,0,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,0,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,0,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,0,NaN,S

In [33]:
###원본 수정 목적이면 체인 인덱싱 하지말고, .loc로 접근해라~

df.loc[df["Age"] > 70, "Fare"] = 0
df.loc[df["Age"] > 70, "Fare"]

96     0.0
116    0.0
493    0.0
630    0.0
851    0.0
Name: Fare, dtype: float64

In [34]:
# [정렬]
### True : 오름차순 / False : 내림차순
df.sort_values(by="Fare", ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,0.0000,NaN,Q
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,0.0000,NaN,S

In [35]:
#조건 여러개는 항상 []

df.sort_values(by=['Fare', 'PassengerId'], ascending=[False, True])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0000,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,0.0000,NaN,S

In [36]:
#- 만약 **동점자 정렬 기준**을 추가하고 싶다면 `by`에 목록을 넣어 다중 기준 정렬도 가능
#- 예를 들어, `df2.sort_values(by=['점수','이름'], ascending=[False, True])`   → 점수 내림차순 우선 정렬하되 점수가 같으면 이름 오름차순(가나다순)으로 정렬

- 열 삭제 - `df.drop(columns='열')`
- 행 삭제 - `df.drop(index=인덱스번호)`
- 열 이름 변경 - `df.rename(columns={'현재 열': '바꿀 열'})`

In [37]:
df = df.drop(columns="Fare")

In [38]:
# df.drop(columns="Fare", inplace=True)   #df = 안써도 inplace=True 쓰면 바로 적용할래!! 라는 뜻.
#위의 셀 실행하면 이미 없는데 뭘 삭제하라는겨~ 하면서 안됨

In [39]:
df = df.drop(index=116)

In [40]:
df = df.rename(columns={'Fare':'New Fare'})      #이름 바꾸려면 딕셔너리 형태로 old : new로
df = df.rename(columns={'Fare':'New Fare', 'Age':'new Age'})      #여러개도 가능능능이버섯

In [41]:
data2 = {'이름': ['철수', '영희', '민수', '수지'],
         '점수': [85, 92, 78, 92]}
df4 = pd.DataFrame(data2)
df4

   이름  점수
0  철수  85
1  영희  92
2  민수  78
3  수지  92

In [42]:
df4.sort_values(by='점수', ascending=False)

   이름  점수
1  영희  92
3  수지  92
0  철수  85
2  민수  78

In [43]:
df4.sort_values(by=['점수', '이름'], ascending=[False, True])

   이름  점수
3  수지  92
1  영희  92
0  철수  85
2  민수  78

In [44]:
df4['메모'] = ['임시', '필요없음', '임시', '필요없음']  # 예시로 메모 열 추가
print(df4)

df4_cleaned = df4.drop(columns='메모')
print(df4_cleaned)

   이름  점수    메모
0  철수  85    임시
1  영희  92  필요없음
2  민수  78    임시
3  수지  92  필요없음
   이름  점수
0  철수  85
1  영희  92
2  민수  78
3  수지  92

In [45]:
# df4 = df4.drop(columns='메모')
df4_cleaned = df4.drop(columns='메모')

In [46]:
df4 = df4.drop(index=2)

In [47]:
df4 = df4.rename(columns={'점수':'new 점수'})
df4.head()

   이름  new 점수    메모
0  철수      85    임시
1  영희      92  필요없음
3  수지      92  필요없음

In [48]:
# 두개하면 어케댐 
df4_cleaned = df4.drop(columns=['메모', '이름'])

In [49]:
df4_cleaned

   new 점수
0      85
1      92
3      92

### + 가독성 업그레이드 도구 3종 세트

### (1) `between()` : 구간 조건

`between(left, right)`는 `left <= x <= right` 형태의 불리언 생성

그리고 **NA는 False로 처리된다**(결측 Age는 자동 제외)

예) 20~30세

```python
age_20_30 = titanic_df[titanic_df["Age"].between(20, 30)]
```

### (2) `isin()` : 여러 값 중 하나인지

멤버십 체크에 강함.

예) Embarked가 C 또는 Q인 승객

```python
temp_isin = titanic_df[titanic_df["Embarked"].isin(["C","Q"])]
```

### (3) `isna()` / `notna()` : 결측인지 아닌지

결측인 행까지 포함하고 싶거나 아니거나 조건

예) Age가 결측인 행도 포함해서 어린이(16세 미만) 또는 Age 결측 확인

```python
temp_na = titanic_df[(titanic_df["Age"] < 16) | (titanic_df["Age"].isna())]
```

In [50]:
####### 타이다닉
#이쯤되면 한번 영화 봐야겠다;;

df
#어라 f뭐시기 사라졋다
# 재로드 ㅋ
df = pd.read_csv("train.csv")
df2 = pd.read_csv("titanic_with_duplicates.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [51]:
df.sort_values(by='Fare', ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
466,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0000,NaN,S
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0000,NaN,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S

In [52]:
df.sort_values(by=['Age', 'Name'], ascending=True)  #하나만 써도 되나? 될것같으니까 일단 해 ㅋ 어 실행되네 맞는지는 몰겟지ㅏㅁㄴ
# df.sort_values(by=['Age', 'Name'], ascending=[True, True])  #음 똑같네

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
354,355,0,3,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C
495,496,0,3,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C
240,241,0,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S

In [53]:
df['Cabin'].isna().sum()    #많긴하네요..

np.int64(687)

In [54]:
df_cleaned = df.drop(columns=['Ticket', 'PassengerId', 'Cabin'])
# df_cleaned = df.drop(index=0)
df_cleaned

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,Q

**퀴즈:** Titanic 데이터 정렬/정제 관련 문제를 풀어봅시다.

1. **퀴즈 1:** 가장 **나이가 많은 승객 5명**의 기록을 보고 싶습니다. Titanic 데이터프레임 `titanic_df`를 나이 순으로 내림차순 정렬하여 상위 5명을 출력하는 코드를 작성하세요. 
2. **퀴즈 2:** 분석에 필요 없는 **'Name' 열을 DataFrame에서 제거(drop)하는** 코드를 작성해보세요.
3. **퀴즈 3:** 기존 “Age”, “Fare” 컬럼 명을 “나이”, “요금” 으로 변경하세요.

In [55]:
df.sort_values(by='Age', ascending=False).head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q

In [56]:
df = df.drop(columns='Name')

In [57]:
df.rename(columns={'Age':'나이', 'Fare':'요금'})

,PassengerId,Survived,Pclass,Sex,나이,SibSp,Parch,Ticket,요금,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

### + 정제는 삭제만이 아니다 : 표준화도 정제다

예) Sex 값이 `female`, `Female`, `female` 처럼 섞여 있으면 모델/통계가 망가진다. → 이럴 땐 문자열 표준화

In [58]:
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [59]:
df["Sex"] = df["Sex"].astype("string").str.strip().str.lower()  #c+s+L은 최고야

#.dt?

결측치(Missing Value)란 말 그대로 비어 있는 값 →NaN (Not a Number) 또는 NaT,  None으로 표시

결측치를 다루는 일반적인 방법은 두 가지:

1. **결측치가 있는 행/열 삭제** – 결측치가 극히 일부거나 해당 행/열이 크게 중요하지 않다면 아예 제거
2. **결측치를 특정 값으로 대체 (대치, imputation)** – 결측치가 많은 경우 삭제하면 데이터 손실 ⏫ 
    1. 수치형 변수 : 평균값이나 최빈값 등 **합리적인 값으로 채워 넣기**
    2. 범주형 변수 : “Unknown” 이라는 **합리적인 값으로 채워 넣기**

어떤 방법을 택할지는 상황에 따라 다릅니다. 

- 결측이 **적은 비율**이면 삭제가 간편하고, **많은 비율**이면 대체를 고려
- 결측치가 **어떻게 발생**했는지 (무작위인지 어떤 패턴인지) 도 중요한 판단 기준 → 현재는 모름

In [60]:
# 결측치가 포함된 예제 Series
s = pd.Series([10, None, 30, None, 50])
print("원본 Series:")
print(s)

원본 Series:
0    10.0
1     NaN
2    30.0
3     NaN
4    50.0
dtype: float64

In [61]:
s.isna()    #s.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [62]:
df.isna()   #불린횽 데이터프레임. 아까는 시리즈라 시리즈가 ㄴ ㅏ왓고 너는 df라 df가 나왘ㅆ다 (홍시맛이나서홍시라하엿는데,,,)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,True,False

In [63]:
s.isna().sum()

np.int64(2)

In [64]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [65]:
### 까리하게 쓰기
missing_cnt = df.isna().sum().sort_values(ascending=False)  #내림차순으로 정렬함. isna sum 씀 ㅇㅇ 넣어서? 아래서 한번에 보겠다
##비율로 보기 ㅋㅋㅋ 아 비율이구나 평균을 구해서 * 100하면 결측치의 비율을 알 수 있다~
missing_ratio = (df.isna().mean() * 100).sort_values(ascending=False) #똑같네? .mean은 뭐여 아 그 int 친구들만 모아서 쓰는 ㄴ건가/ round 마렵네 불편하다
missing_ratio = (df.isna().mean() * 100).sort_values(ascending=False).round(2)

missing_cnt, missing_ratio

(Cabin          687
 Age            177
 Embarked         2
 Pclass           0
 Survived         0
 PassengerId      0
 Sex              0
 Parch            0
 SibSp            0
 Fare             0
 Ticket           0
 dtype: int64,
 Cabin          77.10
 Age            19.87
 Embarked        0.22
 Pclass          0.00
 Survived        0.00
 PassengerId     0.00
 Sex             0.00
 Parch           0.00
 SibSp           0.00
 Fare            0.00
 Ticket          0.00
 dtype: float64)

- **결측치 제거**
    - `dropna()` 메서드는 NaN이 있는 **행(혹은 값)들을 제거**
    - Series의 경우 NaN 값을 제거하고 남은 값만 반환
    - DataFrame의 경우에는 기본적으로 결측치가 있는 **행을 날려버리며**, `axis=1` 옵션을 주면 열을 날릴 수도 있습니다.
    - `subset` 옵션을 주면 내가 원하는 열에 대한 결측치 행만 삭제 가능

In [66]:
s.dropna() # 다 날림

0    10.0
2    30.0
4    50.0
dtype: float64

In [67]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [68]:
df_cleaned = df.dropna(subset=['Embarked'])  #subset=로 컬럼 딱 지정해주기 + 삭제지정변경은 받아야 변경됨 받어~!
df_cleaned.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [69]:
s_dropped = s.dropna()
print("결측치 제거 후 Series:")
print(s_dropped)

결측치 제거 후 Series:
0    10.0
2    30.0
4    50.0
dtype: float64

- **결측치 대체**
    - `fillna()` 메서드는 결측값을 주어진 값으로 채움
    - 예를 들어 NaN을 모두 0으로 채우면:

In [70]:
s_filled_zero = s.fillna(0)
print("NaN을 0으로 채운 Series:")
print(s_filled_zero)

NaN을 0으로 채운 Series:
0    10.0
1     0.0
2    30.0
3     0.0
4    50.0
dtype: float64

In [71]:
print("평균값으로 채우기:", s.fillna(s.mean()))
print("중앙값으로 채우기:", s.fillna(s.median()))

평균값으로 채우기: 0    10.0
1    30.0
2    30.0
3    30.0
4    50.0
dtype: float64
중앙값으로 채우기: 0    10.0
1    30.0
2    30.0
3    30.0
4    50.0
dtype: float64

In [72]:
df = pd.read_csv("train.csv")
df2 = pd.read_csv("titanic_with_duplicates.csv")

#대시

In [73]:
df['Age'].mean()    #평균 (시리즈의)

np.float64(29.69911764705882)

In [74]:
df['Age'].median()  #중앙ㅂ갓 (시리즈의)

np.float64(28.0)

In [75]:
df['Age'].min()  #최솟값 (시리즈의)
df['Age'].max()  #최댓값 (시리즈의)
df['Age'].std()  #표준편ㅊ ㅏ (시리즈의)

np.float64(14.526497332334042)

In [76]:
df['Age'].mean()    #평균 (시리즈의)

np.float64(29.69911764705882)

In [77]:
df['Age'].median()  #중앙ㅂ갓 (시리즈의)

np.float64(28.0)

In [78]:
df['Age'].fillna(df['Age'].min())      #최솟값을 꺼내서 채운다잉 (뽑는다!) 
#이것도 재할당해야됨? 아하 재할당 하거나 inplace=True 하거나!

0      22.00
1      38.00
2      26.00
3      35.00
4      35.00
       ...
886    27.00
887    19.00
888     0.42
889    26.00
890    32.00
Name: Age, Length: 891, dtype: float64

In [79]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [80]:
df['Embarked'].isna()   #False만 나옴 (결측 = TRUE)
df[df['Embarked'].isna()]   #True만 보고 싶으면 []로 감싸주면 됨 (True 검문소) : 통과(True)만 남음

df.loc[df['Embarked'].isna()]   #이렇게 해도 됨
df.loc[~df['Embarked'].notna()] #같은 녀석들

df.loc[~df['Embarked'].isna()]  #False만 보고 싶으면 이렇게

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [81]:
df.loc[~df['Embarked'].notna()]
# 정확히 동일한 값 나옴
df.loc[df['Embarked'].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [82]:
#Embarked (2) : 제거해버려 걍 너무 적어 아니면 바꿔(대체) (최빈값으로) -> value_counts()
#Age (177) : 중앙값? 여성의 평균값, 남성의 평균값으로 각각 대체 (그룹별로 평균 대체) -> 
#Cabin (687) :

In [83]:
df['Embarked'].value_counts()
#음 S로 채우면 되겠군

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [84]:
df[['Sex', 'Age']].head()

      Sex   Age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0

In [85]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [86]:
df_cleaned = df.dropna(subset=['Embarked'])

## 중복 제거 반드시 해야지

- 중복 데이터란 동일한 값의 행이 데이터셋에 반복되어 나타나는 경우
- 중복이 생기는 이유는 여러 가지인데
    - 데이터를 여러 소스로부터 합치는 과정에서 **같은 사람이 두 번 기록**되었을 때,
    - 센서 오작동 등으로 **동일한 로그가 반복** 저장되었을 때,
    - 크롤링이나 입력 실수로 **똑같은 행이 중복 입력**되었을 때 등이 있습니다.

**특정 케이스가 과대대표**되어 잘못된 결과를 초래 → 어떤 고객이 이중으로 기록되어 구매 횟수가 2배로 집계된다면 실제보다 부풀려진 통계 발생

In [87]:
df3 = pd.DataFrame({'제품': ['A', 'B', 'B', 'C'],
                    '가격': [1000, 2000, 2000, 3000]})
print(df3)

  제품    가격
0  A  1000
1  B  2000
2  B  2000
3  C  3000

In [88]:
df3.duplicated(keep="first").sum()
#keep = first : 첫번째로 등장한 애만 보겠다 (중복은 안 보겠다)
#last : 마지막인 애들을 남긴다 (마지막만 보겟다)
#false : 중복행을 모두 제거하겠다 (오마에오 하이죠스루)

np.int64(1)

In [89]:
df3_cleaned = df3.drop_duplicates() #s구나 헤헤

- **중복 여부 확인**
    - `df.duplicated()` 각 행이 이전에 이미 나타난 행과 중복인지 True/False로 표시하는 불린 Series를 반환
    - 기본적으로 **첫 등장 행은 False, 그 다음부터의 중복행은 True**로 표시
    - `df.duplicated().sum()` 을 사용하면 전체 중복 행 개수 파악

- **중복 행 제거**
    - `df.drop_duplicates()` **중복된 행을 제거**하고 **유일(unique)한 행만 남긴** DataFrame을 반환
    - 기본 설정에서는 **중복이 발생하면 가장 처음 나타난 행을 남기고 그 이후 중복된 행들을 제거**(`keep='first'`).

In [90]:
df = pd.read_csv("train.csv")
df2 = pd.read_csv("titanic_with_duplicates.csv")    #중복데이터가 있는 파일

In [91]:
df2.head()

   PassengerId  survived  pclass     sex   age  sibsp  parch   fare embarked
0            8         1       3  female  30.0      0      0  13.00        S
1            1         0       3    male  22.0      1      0   7.25        S
2            5         0       3    male  28.0      0      0   8.05        S
3            1         0       3    male  22.0      1      0   7.25        S
4            6         1       2  female  27.0      0      0  10.50        S

In [92]:
df2.shape

(13, 9)

In [93]:
df2.duplicated().sum()

np.int64(5)

In [94]:
df2.drop_duplicates()

,PassengerId,survived,pclass,sex,age,sibsp,parch,fare,embarked
0,8,1,3,female,30.0,0,0,13.0000,S
1,1,0,3,male,22.0,1,0,7.2500,S
2,5,0,3,male,28.0,0,0,8.0500,S
4,6,1,2,female,27.0,0,0,10.5000,S
6,2,1,1,female,38.0,1,0,71.2833,C
8,4,0,1,male,35.0,1,0,53.1000,S
10,7,0,3,male,19.0,0,0,7.8958,S
11,3,1,3,female,26.0,0,0,7.9250,S

In [95]:
import pandas as pd
import numpy as np
dup_df = pd.DataFrame({
    "PassengerId": [1, 1, 2, 2, 2, 3, 3],
    "Name":        ["Allen, Mr.", "Allen, Mr.", "Baker, Mr.", "Baker, Mr.", "Baker, Mr.", "Clark, Mrs.", "Clark, Mrs."],
    "Age":         [22, 22, np.nan, 35, 35, 29, np.nan],
    "Fare":        [7.25, 7.25, 8.05, np.nan, 8.05, 71.28, 71.28],
    "Embarked":    ["S", "S", "S", "S", "S", "C", "C"],
})
dup_df

   PassengerId         Name   Age   Fare Embarked
0            1   Allen, Mr.  22.0   7.25        S
1            1   Allen, Mr.  22.0   7.25        S
2            2   Baker, Mr.   NaN   8.05        S
3            2   Baker, Mr.  35.0    NaN        S
4            2   Baker, Mr.  35.0   8.05        S
5            3  Clark, Mrs.  29.0  71.28        C
6            3  Clark, Mrs.   NaN  71.28        C

### + 중복은 두 종류가 있다

실무에서는 중복을 이렇게 나눠 봐야 함:

1. **완전 중복(행 전체가 동일)**
    
    → `drop_duplicates()`로 끝
    
2. **키 중복(예: PassengerId는 같지만 다른 컬럼이 다름)**
    
    → 어느 행을 남길지 규칙이 필요
    
    예:
    
    - 결측이 더 적은 행을 남긴다
    - 최신 타임스탬프를 남긴다
    - 특정 컬럼을 우선한다

**예: PassengerId가 같은 행 중 “결측이 더 적은” 행을 남기기**
시간이 필요하니까 최근 걸 남기겠다
Fare니까 높은 값을 남겨야겠다

이런 조건을 본인이 세워야함

In [96]:
temp = dup_df.copy()

In [97]:
temp.isna().sum()

PassengerId    0
Name           0
Age            2
Fare           1
Embarked       0
dtype: int64

In [98]:
temp.isna().sum(axis=1) #axis=1로 행기준으로 볼 수 있음(행단위로)

0    0
1    0
2    1
3    1
4    0
5    0
6    1
dtype: int64

In [99]:
temp['na_count'] = temp.isna().sum(axis=1)
temp

   PassengerId         Name   Age   Fare Embarked  na_count
0            1   Allen, Mr.  22.0   7.25        S         0
1            1   Allen, Mr.  22.0   7.25        S         0
2            2   Baker, Mr.   NaN   8.05        S         1
3            2   Baker, Mr.  35.0    NaN        S         1
4            2   Baker, Mr.  35.0   8.05        S         0
5            3  Clark, Mrs.  29.0  71.28        C         0
6            3  Clark, Mrs.   NaN  71.28        C         1

In [100]:
## 결측 적은 애를 남길 거니까 일단 정렬

temp.sort_values(by=['PassengerId', 'na_count'])    #as어쩌구 기본 : TRue

   PassengerId         Name   Age   Fare Embarked  na_count
0            1   Allen, Mr.  22.0   7.25        S         0
1            1   Allen, Mr.  22.0   7.25        S         0
4            2   Baker, Mr.  35.0   8.05        S         0
2            2   Baker, Mr.   NaN   8.05        S         1
3            2   Baker, Mr.  35.0    NaN        S         1
5            3  Clark, Mrs.  29.0  71.28        C         0
6            3  Clark, Mrs.   NaN  71.28        C         1

In [101]:
temp.sort_values(by=['PassengerId', 'na_count']).drop_duplicates(subset=['PassengerId'])        

#정렬을 PassengerId(1순위), na_count(2순위)로 할 거야
#subset로 'PassengerId' 기준으로 드랍할 건데~ 라는 거

##drop_duplicates(subset=['PassengerId']) : 이제 같은 승객 번호를 가진 데이터들 중 맨 위에 있는 것만 남기고 나머지는 버리는 거
## 숨어있는 keep=first : 판다스의 기본값 (keep='first'): 중복된 것들 중 가장 첫 번째(맨 위) 행만 남김

   PassengerId         Name   Age   Fare Embarked  na_count
0            1   Allen, Mr.  22.0   7.25        S         0
4            2   Baker, Mr.  35.0   8.05        S         0
5            3  Clark, Mrs.  29.0  71.28        C         0